In [61]:
import numpy as np
import pandas as pd
np.random.seed(42)
this=np.random.randint(0, 101, size=10)
print(f"Numpy array is {this}")
that=pd.Series(this)
print(that)

Numpy array is [51 92 14 71 60 20 82 86 74 74]
0    51
1    92
2    14
3    71
4    60
5    20
6    82
7    86
8    74
9    74
dtype: int64

In [62]:
import pandas as pd
ls=["Apple","Tesla","Persimmon","Adidas"]
l=pd.Series(ls)
print(l)

0        Apple
1        Tesla
2    Persimmon
3       Adidas
dtype: object

In [63]:
import pandas as pd
ls=["Apple","Tesla","Persimmon","Adidas"]
x = pd.Series(ls, index = ["A", "B", "C","D"])
print(x)

A        Apple
B        Tesla
C    Persimmon
D       Adidas
dtype: object

In [64]:
import pandas as pd
ls=["Apple","Tesla","Persimmon","Adidas"]
x = pd.Series(ls, index = ["A", "B", "C","D"])
print(x.iloc[0])

Apple

In [65]:
import pandas as pd
ls=["Apple","Tesla","Persimmon","Adidas"]
x = pd.Series(ls, index = ["A", "B", "C","D"])
print(x.iloc[0:3])

A        Apple
B        Tesla
C    Persimmon
dtype: object

In [66]:
import pandas as pd
ls=["Apple","Tesla","Persimmon","Adidas"]
x = pd.Series(ls, index = ["A", "B", "C","D"])
print(x.loc["A"])

Apple

In [67]:
import pandas as pd
import numpy as np
np.random.seed(42)
this=np.random.randint(0, 101, size=10)
fl=pd.DataFrame(this,columns=['Numbers'])
fl

   Numbers
0       51
1       92
2       14
3       71
4       60
5       20
6       82
7       86
8       74
9       74

In [68]:
import pandas as ujwal
dat=[['Dikesh',12],['Ronish',31],['Ujwal',40]]
df=ujwal.DataFrame(dat,columns=['Name','Roll'])
df

     Name  Roll
0  Dikesh    12
1  Ronish    31
2   Ujwal    40

In [69]:
import pandas as ujwal
fil="/home/nullproj/Documents/BIM-5th-semester/python/practice/pandas/FSI.xlsx"
df=ujwal.read_excel(fil)
df

                      Country  Demo  Refugees  Group  Flight
0                     Somalia  10.0       9.0    8.7     8.6
1                         NaN   9.6       9.6    8.8     6.4
2                 South Sudan   9.7      10.0    8.6     6.5
3   Congo Democratic Republic   9.7       9.8    NaN     6.4
4                       Syria   7.4       9.1    9.1     8.0
5                 Afghanistan   NaN       8.6    8.3     8.5
6                       Sudan   8.8       9.6    9.3     7.5
7                         NaN   9.3       9.5    8.1     6.2
8                        Chad   9.5       9.0    NaN     7.7
9                       Haiti   8.8       7.7    5.5     8.3
10                   Ethiopia   9.8       NaN    8.9     6.2
11                       Mali   8.8       8.5    8.5     7.7
12                     Guinea   8.8       6.2    9.4     NaN
13                        NaN   NaN       6.4    8.6     6.7

In [70]:
import pandas as ujwal
name="/home/nullproj/Documents/BIM-5th-semester/python/practice/pandas/output.csv"
df=ujwal.read_csv(name,on_bad_lines="skip")
df

,Unnamed: 0,summary,label,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,0,भारत सरकारले प्रमुख विपक्षी दल कंग्रेसका अध्यक...,1,NaN,NaN,NaN
1,1,विद्युत चोरीमा संलग्न भएको आरोपमा विद्युत प्रा...,2,NaN,NaN,NaN
2,2,इटलीमा कोरोनाभाइरसको सङ्क्रमणबाट मृत्यु हुने म...,0,NaN,NaN,NaN
3,3,पश्चिमोत्तर चीनको शिन्जियाङ क्षेत्रका मुख्यतः ...,0,NaN,NaN,NaN
4,4,अमेरिकी राष्ट्रपतिले डोनाल्ड ट्रम्पले भेनेजुएल...,1,NaN,NaN,NaN
...,...,...,...,...,...,...
720,720,नेपालको काँधमा कुल ११ खर्ब रुपैयाँको ऋण छ र हर...,0,NaN,NaN,NaN
721,721,श्रीलंकाका अधिकारीहरुले सन् १९८० को दशकताका हज...,0,NaN,NaN,NaN
722,722,रुसमा एउटा भव्य समारोहबीच आरम्भ भएको विश्वकप फ...,1,NaN,NaN,NaN
723,723,दुई दिनदेखि भारतको उत्तर प्रदेशका सञ्जय कुमारल...,0,NaN,NaN,NaN
724,724,इटलीमा कोरोनाभाइसका कारण एकै दिन ४२७ जनाको ज्य...,0,NaN,NaN,NaN

In [71]:
df.head()

,Unnamed: 0,summary,label,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,0,भारत सरकारले प्रमुख विपक्षी दल कंग्रेसका अध्यक...,1,NaN,NaN,NaN
1,1,विद्युत चोरीमा संलग्न भएको आरोपमा विद्युत प्रा...,2,NaN,NaN,NaN
2,2,इटलीमा कोरोनाभाइरसको सङ्क्रमणबाट मृत्यु हुने म...,0,NaN,NaN,NaN
3,3,पश्चिमोत्तर चीनको शिन्जियाङ क्षेत्रका मुख्यतः ...,0,NaN,NaN,NaN
4,4,अमेरिकी राष्ट्रपतिले डोनाल्ड ट्रम्पले भेनेजुएल...,1,NaN,NaN,NaN

In [72]:
df.tail()

,Unnamed: 0,summary,label,Unnamed: 3,Unnamed: 4,Unnamed: 5
720,720,नेपालको काँधमा कुल ११ खर्ब रुपैयाँको ऋण छ र हर...,0,NaN,NaN,NaN
721,721,श्रीलंकाका अधिकारीहरुले सन् १९८० को दशकताका हज...,0,NaN,NaN,NaN
722,722,रुसमा एउटा भव्य समारोहबीच आरम्भ भएको विश्वकप फ...,1,NaN,NaN,NaN
723,723,दुई दिनदेखि भारतको उत्तर प्रदेशका सञ्जय कुमारल...,0,NaN,NaN,NaN
724,724,इटलीमा कोरोनाभाइसका कारण एकै दिन ४२७ जनाको ज्य...,0,NaN,NaN,NaN

In [74]:
print(f"The shape is {df.shape}")

The shape is (725, 6)

In [75]:
print(f"The index is {df.index}")

The index is RangeIndex(start=0, stop=725, step=1)

In [76]:
print(f"The columns are {df.columns}")

The columns are Index(['Unnamed: 0', 'summary', 'label', 'Unnamed: 3', 'Unnamed: 4',
       'Unnamed: 5'],
      dtype='object')

In [77]:
print(f"The data types are {df.dtypes}")

The data types are Unnamed: 0      int64
summary        object
label          object
Unnamed: 3     object
Unnamed: 4     object
Unnamed: 5    float64
dtype: object

In [78]:
print("The values iare ",df.values)

The values iare  [[0
  'भारत सरकारले प्रमुख विपक्षी दल कंग्रेसका अध्यक्ष राहुल गान्धीलाई उनीसँग विदेशी नागरिकता भए नभएको स्पष्ट पार्न भनेको छ।'
  '1' nan nan nan]
 [1
  'विद्युत चोरीमा संलग्न भएको आरोपमा विद्युत प्राधिकरणका कर्मचारी र व्यापारी गरी १६ जनलाई पक्रेर अनुसन्धान थालेको नेपाल प्रहरीले कारबाही प्रक्रियालाई अझ तीव्र बनाउने बताएको छ।'
  '2' nan nan nan]
 [2
  'इटलीमा कोरोनाभाइरसको सङ्क्रमणबाट मृत्यु हुने मानिसको सङ्ख्या १३३ थपिएर ३६६ पुगेको अधिकारीहरूले जनाएका छन्।'
  '0' nan nan nan]
 ...
 [722
  'रुसमा एउटा भव्य समारोहबीच आरम्भ भएको विश्वकप फुटबलको उद्घाटन खेलमा आयोजक रुस र साउदी अरेबियाबीच प्रतिस्पर्धा भएको थियो।'
  '1' nan nan nan]
 [723
  'दुई दिनदेखि भारतको उत्तर प्रदेशका सञ्जय कुमारले आफू र आफ्नी आमालाई कोरोनाभाइरस खोप लगाउन खोजिरहेका थिए।'
  '0' nan nan nan]
 [724
  'इटलीमा कोरोनाभाइसका कारण एकै दिन ४२७ जनाको ज्यान गएपछि त्यहाँ कोभिड-१९ रोगका कारण मृत्यु हुने बिरामीहरूको सङ्ख्या अन्य देशहरूको तुलनामा सबैभन्दा बढी पुगेको देखिएको छ।'
  '0' nan nan nan]]

In [79]:
print("The Size is ",df.size)

The Size is  4350

In [80]:
print("The dimension is ",df.ndim)

The dimension is  2

In [81]:
print("Is the dataframe empty?: ",df.empty)

Is the dataframe empty?:  False

In [82]:
print("\nThe Transpose is",df.T)

The Transpose is                                                           0    \
Unnamed: 0                                                  0
summary     भारत सरकारले प्रमुख विपक्षी दल कंग्रेसका अध्यक...
label                                                       1
Unnamed: 3                                                NaN
Unnamed: 4                                                NaN
Unnamed: 5                                                NaN

                                                          1    \
Unnamed: 0                                                  1
summary     विद्युत चोरीमा संलग्न भएको आरोपमा विद्युत प्रा...
label                                                       2
Unnamed: 3                                                NaN
Unnamed: 4                                                NaN
Unnamed: 5                                                NaN

                                                          2    \
Unnamed: 0                                                  2
summary     इटलीमा कोरोनाभाइरसको सङ्क्रमणबाट मृत्यु हुने म...
label                                                       0
Unnamed: 3                                                NaN
Unnamed: 4                                                NaN
Unnamed: 5                                                NaN

                                                          3    \
Unnamed: 0                                                  3
summary     पश्चिमोत्तर चीनको शिन्जियाङ क्षेत्रका मुख्यतः ...
label                                                       0
Unnamed: 3                                                NaN
Unnamed: 4                                                NaN
Unnamed: 5                                                NaN

                                                          4    \
Unnamed: 0                                                  4
summary     अमेरिकी राष्ट्रपतिले डोनाल्ड ट्रम्पले भेनेजुएल...
label                                                       1
Unnamed: 3                                                NaN
Unnamed: 4                                                NaN
Unnamed: 5                                                NaN

                                                          5    \
Unnamed: 0                                                  5
summary     स्वाब परीक्षणको सङ्ख्या देशव्यापी रूपमा बढाएर ...
label                                                       0
Unnamed: 3                                                NaN
Unnamed: 4                                                NaN
Unnamed: 5                                                NaN

                                                          6    \
Unnamed: 0                                                  6
summary     प्रधानमन्त्री प्रचण्डले द्वन्द्वकालीन मुद्दामा...
label                                                       0
Unnamed: 3                                                NaN
Unnamed: 4                                                NaN
Unnamed: 5                                                NaN

                                                          7    \
Unnamed: 0                                                  7
summary     अमेरिकी राष्ट्रपति डोनल्ड ट्रम्पविरुद्ध महाभिय...
label                                                       1
Unnamed: 3                                                NaN
Unnamed: 4                                                NaN
Unnamed: 5                                                NaN

                                                          8    \
Unnamed: 0                                                  8
summary     अमेरिकी राष्ट्रपति डोनल्ड ट्रम्पले अमेरिका छिर...
label                                                       0
Unnamed: 3                                                NaN
Unnamed: 4                                                NaN
Unnamed: 5                                                NaN

                                                          9    ...  \
Unnamed: 0                                                  9  ...
summary     अमेरिकाका वैज्ञानिकहरूले क्यान्सर परीक्षणका ला...  ...
label                                                       2  ...
Unnamed: 3                                                NaN  ...
Unnamed: 4                                                NaN  ...
Unnamed: 5                                                NaN  ...

                                                          715  \
Unnamed: 0                                                715
summary     इस्लामिक स्टेट (आईएस) लडाकु समूहद्वारा दासीको ...
label                                                       0
Unnamed: 3                                                NaN
Unnamed: 4                                                NaN
Unnamed: 5                                                NaN

                                                          716  \
Unnamed: 0                                                716
summary     चीनको वुहानमा एक नवजात शिशुमा ३० घण्टाभित्रै क...
label                                                       0
Unnamed: 3                                                NaN
Unnamed: 4                                                NaN
Unnamed: 5                                                NaN

                                                          717  \
Unnamed: 0                                                717
summary     करोडौँ वर्षअघि पृथ्वीबाट लोप भएका डाइनसोरहरू भ...
label                                                       1
Unnamed: 3                                                NaN
Unnamed: 4                                                NaN
Unnamed: 5                                                NaN

                                                          718  \
Unnamed: 0                                                718
summary     नेत्रविक्रम चन्द नेतृत्वको नेपाल कम्युनिस्ट पा...
label                                                       2
Unnamed: 3                                                NaN
Unnamed: 4                                                NaN
Unnamed: 5                                                NaN

                                                          719  \
Unnamed: 0                                                719
summary     बेलारुसका राष्ट्रपति एलेक्जेन्डर लुकाशेन्काका ...
label                                                       0
Unnamed: 3                                                NaN
Unnamed: 4                                                NaN
Unnamed: 5                                                NaN

                                                          720  \
Unnamed: 0                                                720
summary     नेपालको काँधमा कुल ११ खर्ब रुपैयाँको ऋण छ र हर...
label                                                       0
Unnamed: 3                                                NaN
Unnamed: 4                                                NaN
Unnamed: 5                                                NaN

                                                          721  \
Unnamed: 0                                                721
summary     श्रीलंकाका अधिकारीहरुले सन् १९८० को दशकताका हज...
label                                                       0
Unnamed: 3                                                NaN
Unnamed: 4                                                NaN
Unnamed: 5                                                NaN

                                                          722  \
Unnamed: 0                                                722
summary     रुसमा एउटा भव्य समारोहबीच आरम्भ भएको विश्वकप फ...
label                                                       1
Unnamed: 3                                                NaN
Unnamed: 4                                                NaN
Unnamed: 5                                                NaN

                                                          723  \
Unnamed: 0                                                723
summary     दुई दिनदेखि भारतको उत्तर प्रदेशका सञ्जय कुमारल...
label                                                       0
Unnamed: 3                                                NaN
Unnamed: 4                                                NaN
Unnamed: 5                                                NaN

                                                          724
Unnamed: 0                                                724
summary     इटलीमा कोरोनाभाइसका कारण एकै दिन ४२७ जनाको ज्य...
label                                                       0
Unnamed: 3                                                NaN
Unnamed: 4                                                NaN
Unnamed: 5                                                NaN

[6 rows x 725 columns]

In [83]:
import pandas as ujwal
filename="/home/nullproj/Documents/BIM-5th-semester/python/practice/pandas/FSINULL.xlsx"
fd=ujwal.read_excel(filename)
print(df.isnull())

     Unnamed: 0  summary  label  Unnamed: 3  Unnamed: 4  Unnamed: 5
0         False    False  False        True        True        True
1         False    False  False        True        True        True
2         False    False  False        True        True        True
3         False    False  False        True        True        True
4         False    False  False        True        True        True
..          ...      ...    ...         ...         ...         ...
720       False    False  False        True        True        True
721       False    False  False        True        True        True
722       False    False  False        True        True        True
723       False    False  False        True        True        True
724       False    False  False        True        True        True

[725 rows x 6 columns]

In [84]:
print(df.notnull())

     Unnamed: 0  summary  label  Unnamed: 3  Unnamed: 4  Unnamed: 5
0          True     True   True       False       False       False
1          True     True   True       False       False       False
2          True     True   True       False       False       False
3          True     True   True       False       False       False
4          True     True   True       False       False       False
..          ...      ...    ...         ...         ...         ...
720        True     True   True       False       False       False
721        True     True   True       False       False       False
722        True     True   True       False       False       False
723        True     True   True       False       False       False
724        True     True   True       False       False       False

[725 rows x 6 columns]

In [85]:
totalnull=df.isnull().sum()
print("Total number of null values",totalnull)

Total number of null values Unnamed: 0      0
summary         0
label           1
Unnamed: 3    685
Unnamed: 4    714
Unnamed: 5    724
dtype: int64

In [86]:
nonulldf = df.dropna()
nonulldf

,Unnamed: 0,summary,label,Unnamed: 3,Unnamed: 4,Unnamed: 5
651,651,चिकित्सा शिक्षा क्षेत्रमा सुधारको माग गर्दै आम...,पूर्वप्रधानमन्त्री,चर्चित वामपन्थी लेखक,कलाकार र नागरिक अगुवाहरू सहभागी भएका छन्।,2.0

In [89]:
import pandas as pd
filename = "/home/nullproj/Documents/BIM-5th-semester/python/practice/pandas/FSINULL.xlsx"
df = pd.read_excel(filename)
print(df[df.isna().any(axis =1)])
#Filling the missing values with the mean valuesdf
df['Demo'].fillna(df['Demo'].mean(), inplace = True)
df['Refugees'].fillna(df['Refugees'].mean(), inplace = True)
df['Group'].fillna(df['Group'].mean(), inplace = True)
df['Flight'].fillna(df['Flight'].mean(), inplace = True)
df['Country'].fillna('No_Country', inplace = True)
df

                      Country  Demo  Refugees  Group  Flight
1                         NaN   9.6       9.6    8.8     6.4
3   Congo Democratic Republic   9.7       9.8    NaN     6.4
5                 Afghanistan   NaN       8.6    8.3     8.5
7                         NaN   9.3       9.5    8.1     6.2
8                        Chad   9.5       9.0    NaN     7.7
10                   Ethiopia   9.8       NaN    8.9     6.2
12                     Guinea   8.8       6.2    9.4     NaN
13                        NaN   NaN       6.4    8.6     6.7

                      Country       Demo   Refugees     Group    Flight
0                     Somalia  10.000000   9.000000  8.700000  8.600000
1                  No_Country   9.600000   9.600000  8.800000  6.400000
2                 South Sudan   9.700000  10.000000  8.600000  6.500000
3   Congo Democratic Republic   9.700000   9.800000  8.483333  6.400000
4                       Syria   7.400000   9.100000  9.100000  8.000000
5                 Afghanistan   9.183333   8.600000  8.300000  8.500000
6                       Sudan   8.800000   9.600000  9.300000  7.500000
7                  No_Country   9.300000   9.500000  8.100000  6.200000
8                        Chad   9.500000   9.000000  8.483333  7.700000
9                       Haiti   8.800000   7.700000  5.500000  8.300000
10                   Ethiopia   9.800000   8.692308  8.900000  6.200000
11                       Mali   8.800000   8.500000  8.500000  7.700000
12                     Guinea   8.800000   6.200000  9.400000  7.284615
13                 No_Country   9.183333   6.400000  8.600000  6.700000

In [90]:
col1 = df['Country']
print(col1)
col2 = df[['Group','Flight']]
print(col2)

0                       Somalia
1                    No_Country
2                   South Sudan
3     Congo Democratic Republic
4                         Syria
5                   Afghanistan
6                         Sudan
7                    No_Country
8                          Chad
9                         Haiti
10                     Ethiopia
11                         Mali
12                       Guinea
13                   No_Country
Name: Country, dtype: object
       Group    Flight
0   8.700000  8.600000
1   8.800000  6.400000
2   8.600000  6.500000
3   8.483333  6.400000
4   9.100000  8.000000
5   8.300000  8.500000
6   9.300000  7.500000
7   8.100000  6.200000
8   8.483333  7.700000
9   5.500000  8.300000
10  8.900000  6.200000
11  8.500000  7.700000
12  9.400000  7.284615
13  8.600000  6.700000

In [91]:
import pandas as pd
filename = "/home/nullproj/Documents/BIM-5th-semester/python/practice/pandas/FSINULL.xlsx"
df = pd.read_excel(filename)
print(df[df.isna().any(axis =1)])
df['Demo'] = df['Demo'].fillna(df['Demo'].mean())
df['Refugees'] = df['Refugees'].fillna(df['Refugees'].mean())
df['Group'] = df['Group'].fillna(df['Group'].mean())
df['Flight'] = df['Flight'].fillna(df['Flight'].mean())
df['Country'] = df['Country'].fillna('No_Country')
df

                      Country  Demo  Refugees  Group  Flight
1                         NaN   9.6       9.6    8.8     6.4
3   Congo Democratic Republic   9.7       9.8    NaN     6.4
5                 Afghanistan   NaN       8.6    8.3     8.5
7                         NaN   9.3       9.5    8.1     6.2
8                        Chad   9.5       9.0    NaN     7.7
10                   Ethiopia   9.8       NaN    8.9     6.2
12                     Guinea   8.8       6.2    9.4     NaN
13                        NaN   NaN       6.4    8.6     6.7

                      Country       Demo   Refugees     Group    Flight
0                     Somalia  10.000000   9.000000  8.700000  8.600000
1                  No_Country   9.600000   9.600000  8.800000  6.400000
2                 South Sudan   9.700000  10.000000  8.600000  6.500000
3   Congo Democratic Republic   9.700000   9.800000  8.483333  6.400000
4                       Syria   7.400000   9.100000  9.100000  8.000000
5                 Afghanistan   9.183333   8.600000  8.300000  8.500000
6                       Sudan   8.800000   9.600000  9.300000  7.500000
7                  No_Country   9.300000   9.500000  8.100000  6.200000
8                        Chad   9.500000   9.000000  8.483333  7.700000
9                       Haiti   8.800000   7.700000  5.500000  8.300000
10                   Ethiopia   9.800000   8.692308  8.900000  6.200000
11                       Mali   8.800000   8.500000  8.500000  7.700000
12                     Guinea   8.800000   6.200000  9.400000  7.284615
13                 No_Country   9.183333   6.400000  8.600000  6.700000